{"House-Rules":{"slug":"House-Rules","filePath":"House Rules.md","title":"House Rules","links":[],"tags":[],"content":"This game will primarily use the 2024 D&amp;D 5e ruleset. However, a number of house rules will be in place to support immersion, apply common sense, and better reflect the unique tone of the setting.\nSome adjustments have also been made to accommodate the Eberron campaign setting, which draws heavily from 2014 (and earlier) source material. Most notably, half-elves and half-orcs, integral to Eberron’s lore, will remain available as player options despite their removal from the core 2024 rules.\nThese rules are flexible and open to discussion. The goal is to enhance everyone’s enjoyment of the game, and adjustments may be made as the campaign evolves.\nHero Points\nIn a world scarred by war and shadowed by ambition, true heroes rise through grit, wit, and will. Hero Points represent moments where a character defies the odds—not by luck, but by force of spirit.\nGaining Hero Points\n\nEach character begins with 1 Hero Point at the start of a session.\nThe DM may award additional points for:\n\nBold or clever roleplaying\nSelfless actions or personal sacrifices\nFacing down danger in line with your character’s ideals or flaws\nCompleting key story or faction goals\n\n\n\nYou can hold a maximum of 3 Hero Points.\nSpending Hero Points\nA player may spend 1 Hero Point to do one of the following:\n\nTurn the Tide:\nReroll any d20 test after seeing the result but before knowing the outcome. You must take the second result.\nSurge of Will:\nTake an additional action on your turn (like Action Surge).\nTwist of Fate:\nAutomatically stabilize when dying, or regain 1 HP and stay standing after dropping to 0.\nDeclare an Advantage:\nYou gain advantage on a test that reflects your character’s core drive (e.g. protecting an ally, unmasking a lie, striking a hated foe).\nNarrative Declaration (DM Approval):\nSpend a point to assert a small narrative truth, such as:\n\n“I’ve been here before.”\n“I stashed a weapon here last time.”\n“The guard owes me a favor.”\n\n\n\nNo more than one Hero Point may be used per roll or round unless the DM allows it in a dramatic scene.\nDeath and Dying\nWhen a character is reduced to 0 hit points, choose one of the following systems for how death and recovery work. These can be applied universally or vary by region, enemy, or dramatic moment. In all cases, a creature that is stabilized or revived gains 1 level of exhaustion (2024 core rule).\nOption 1: Standard (2024 Rules)\nBaseline D&amp;D 2024 approach.\n\nDeath saves are rolled as normal.\nYou die after 3 failed death saves, or instantly if damage exceeds max HP.\nYou gain 1 level of exhaustion when revived or stabilized.\n\nOption 2: Wounded But Alive\nBalanced realism—death is possible, but most wounds leave a mark.\n\nUse standard death saving throws.\nWhen stabilized or healed:\n\nGain 1 level of exhaustion, and\nRoll a d20:\n\n1–5: Minor Injury (temporary, fades with rest or treatment)\n6–19: No lasting consequence\n20: Scar (lasting effect or narrative mark)\n\n\n\n\n\nYou can roll with:\n\nAdvantage if healed quickly (within 1 round)\nDisadvantage if felled by a critical hit or took massive damage\n\nOption 3: No Country for Old Minotaurs\nGritty and fast-paced combat with real consequences.\n\nCharacters automatically fail death saving throws. You have 3 rounds to be stabilized or healed.\nIf you take more than 10 damage while at 0 HP, you die instantly.\nEncourages urgency and decisive teamwork.\nCharacters gain 1 level of exhaustion when revived or stabilized.\n\nOption 4: Safety in Numbers\nHeroic tone, focused on team survival and narrative cost.\n\nIf a conscious ally is within 60 feet, you automatically stabilize at the start of your turn. No action required.\nA character only dies if:\n\nAll party members are reduced to 0 HP, or\nThey suffer massive damage (e.g. from a fall or critical hit while unconscious).\nHowever, when reduced to 0 HP, you suffer a Scar (see below).\n\n\nGain 1 level of exhaustion when stabilized or revived.\n\nOption 5: Nothing But Scars\nFor cinematic, story-first campaigns where death is rare but scars linger.\n\nA character only dies if:\n\nThey choose to make a heroic sacrifice, or\nIt’s narratively appropriate (as judged by player and DM).\n\n\nOtherwise, they suffer a Scar (lasting mechanical or narrative wound) instead of dying.\nGain 1 level of exhaustion.\n\nGuidance Cantrip\nThe Guidance cantrip remains a useful tool, but to support immersion and reasonable use, the following limitations apply:\n\nDeclare Before the Roll\nGuidance must be declared before a roll is made. It cannot be applied retroactively.\nShort Actions Only\nThe spell lasts up to one minute, so it can aid a brief task like climbing a rope, picking a lock, or scanning a room. It cannot be used for extended activities such as tracking overland, crafting, or hour-long investigations.\nActive Awareness Required\nA caster must be aware of what the target is doing and be actively choosing to assist. If the caster is engaged in their own task or conversation, they cannot casually throw Guidance onto someone else.\nObvious Casting in Social Situations\nCasting Guidance involves verbal and somatic components. While it may not emit dramatic magical effects, it is noticeable to bystanders—especially in tense or social environments. Using it in front of an NPC may affect their reaction, depending on the situation.\n"},"Mechanics/Races/Kalashtar":{"slug":"Mechanics/Races/Kalashtar","filePath":"Mechanics/Races/Kalashtar.md","title":"Kalashtar","links":[],"tags":[],"content":""},"Mechanics/Races/Shifters":{"slug":"Mechanics/Races/Shifters","filePath":"Mechanics/Races/Shifters.md","title":"Shifters","links":[],"tags":[],"content":""},"Mechanics/Races/Warforged":{"slug":"Mechanics/Races/Warforged","filePath":"Mechanics/Races/Warforged.md","title":"Warforged","links":[],"tags":[],"content":""},"The-World-of-Eberron":{"slug":"The-World-of-Eberron","filePath":"The World of Eberron.md","title":"The World of Eberron","links":[],"tags":[],"content":"Welcome to Eberron\nA world of adventure, mystery and adventure\nWelcome to Eberron, a land where the arcane is woven into everyday life and adventure waits behind every corner. This is not a world of quiet harmony or distant myth; it’s a place alive with conflict, invention, and mystery. The sky is crisscrossed by airships powered by bound elementals, while lightning rails speed across shattered nations still reeling from a century-long war. Magic doesn’t just reside in dusty tomes or hidden towers. It fuels cities, powers tools, and drives innovation. It is as much craft as it is mystery.\nBut the world is still scarred. The Last War tore kingdoms apart and left one nation, Cyre, utterly destroyed in a magical cataclysm known only as the Mourning. Peace, if it can be called that, is uneasy. Spies stalk the shadows, mercenaries sell their swords to the highest bidder, and every nation eyes the others with quiet suspicion. From the ashes of war rise opportunities for those bold enough to seize them, whether as adventurers, scoundrels, diplomats, or outlaws.\nAmid this fragile calm, great powers move in secret. The dragonmarked houses, vast mercantile dynasties marked by mystical sigils of power, shape economies and bend laws. Each house controls a vital industry such as transportation, healing, communication, or warfare, and their influence rivals that of nations. Some see them as progress made manifest; others as a threat waiting to strike.\nWander the labyrinthine streets of Sharn, the City of Towers, where skybridges and suspended platforms form a vertical metropolis of magic and intrigue. Delve into the jungles of Xen’drik, a continent thick with the ruins of a fallen giant empire and secrets too ancient to name. Cross paths with the warforged, sentient constructs built for battle and now searching for meaning in peacetime. Meet shifters, changelings, and kalashtar, unique peoples with strange powers and deep cultural roots, each with their own stories to tell.\nIn Eberron, good and evil aren’t always clear. The monsters may be victims. The villains may believe they’re saviors. Your character’s choices will shape not just their fate, but possibly the fate of nations. Forgotten powers stir beneath the earth, ancient prophecies begin to unfold, and the world stands on the edge of something new or something terrible.\nThis is a world of high adventure, noir intrigue, and arcane invention. It’s a place for daring heists, desperate heroism, and secrets worth dying for. Whether you seek glory, gold, or truth, Eberron offers a stage like no other.\nThe war is over. But the real story is just beginning."},"index":{"slug":"index","filePath":"index.md","title":"Eberron - The Rising Tide","links":[],"tags":[],"content":"\nThis is a blank Quartz installation.\nSee the documentation for how to get started."}}